tools/mutation/patches/k1-post-mixer-ignored.patch
diff --git a/src/check.c b/src/check.c
index 3cb1b60..e40eb42 100644
--- a/src/check.c
+++ b/src/check.c
@@ -243,7 +243,7 @@ static bool check_frequency_on(Check *k, const CapChannel *dc, const IrChannel *
      * When the descriptor says post_mixer and the program declares no mixer,
      * the checker cannot know the offset. Treating the mixer as zero is what
      * produces the unsound pass, so refuse instead. */
-    if (c->post_mixer) {
+    if (0) {
         if (!pc->has_mixer_frequency)
             return tool_error(k, "channel '" STR_FMT "': constraint %s is post_mixer, "
                                  "but the program declares no mixer_frequency",
